appimage.org
#+TITLE: AppImage Loom — Update, Integrate, and Maintain
#+AUTHOR: Mètsàtron — Sovereign Weaver
#+LANGUAGE: en
#+PROPERTY: header-args :mkdirp yes :results silent
#+PROPERTY: header-args:text :comments no
#+PROPERTY: header-args:bash :comments both
#+PROPERTY: header-args:makefile :comments no :padline no

#+BEGIN_SRC text :tangle all/.appimage/inventory/dead-overrides.tsv
# One filename per line (exact basename in ~/Applications). Comments allowed.
# Examples:
citra.AppImage
citra-qt.AppImage
citra-room.AppImage
Linux-Yuzu-EA-4176.AppImage
TOTK Optimizer.AppImage
WiiUDownloader-Linux-x86_64.AppImage
yuzu-mainline-20240301-6879db182.AppImage
#+END_SRC

* AppImage inventory (auto-updated)
#+name: appimage-inventory-supports
#+BEGIN_SRC text :tangle no
FILE	NAME	HAS_UPDATE_INFO	UPDATE_KIND	NOTE
appimaged-904-x86_64.AppImage	appimaged-904-x86_64	yes	ZSync via GitHub Releases	ok
appimagetool-904-x86_64.AppImage	appimagetool-904-x86_64	yes	ZSync via GitHub Releases	ok
appimageupdatetool-x86_64.AppImage	appimageupdatetool-x86_64	yes	ZSync via GitHub Releases	ok
AppImageUpdate-x86_64.AppImage	AppImageUpdate-x86_64	yes	ZSync via GitHub Releases	ok
mkappimage-904-x86_64.AppImage	mkappimage-904-x86_64	yes	ZSync via GitHub Releases	ok
validate-x86_64.AppImage	validate-x86_64	yes	ZSync via GitHub Releases	ok
#+END_SRC

#+name: appimage-inventory-manual
#+BEGIN_SRC text :tangle no
FILE	NAME	HAS_UPDATE_INFO	UPDATE_KIND	NOTE
appimagepool-5.1.0-x86_64.AppImage	appimagepool-5.1.0-x86_64	no		tool-error
balenaEtcher-2.1.3-x64.AppImage	balenaEtcher-2.1.3-x64	no		tool-error
Cool-Retro-Term-1.1.1-x86_64.AppImage	Cool-Retro-Term-1.1.1-x86_64	no	ZSync via GitHub Releases	invalid-pattern
eDEX-UI-Linux-x86_64.AppImage	eDEX-UI-Linux-x86_64	no		tool-error
goxel-0.15.1.AppImage	goxel-0.15.1	no		tool-error
#+END_SRC

#+name: appimage-inventory-dead
#+BEGIN_SRC text :tangle no
citra.AppImage
citra-qt.AppImage
citra-room.AppImage
Linux-Yuzu-EA-4176.AppImage
TOTK Optimizer.AppImage
WiiUDownloader-Linux-x86_64.AppImage
yuzu-mainline-20240301-6879db182.AppImage
#+END_SRC

* Purpose
  Manage AppImages under =~/Applications=: daemon integration, updates (with old file removal), and cleaning of broken desktop entries. Keeps the AIL→appimaged migration helpers around for the future.

* Requirements (packages/tools)

- =desktop-file-utils= (for =desktop-file-validate=)
- =glib2.0-bin= (for =gio=) — optional; falls back to rm if missing
- A recent =systemd --user=, and your binaries in =~/.local/bin=

* Directory conventions

- AppImages live in: =~/Applications=
- User binaries/scripts: =~/.local/bin=
- User services: =~/.config/systemd/user=
- User desktop cache: =~/.local/share/applications=

* AIL → appimaged migration helpers (kept for later use)
  These **do nothing automatically**; you run them when/if you want to migrate.

** Stop & scrub AppImageLauncher artifacts (user + system)
#+BEGIN_SRC bash :tangle all/.local/bin/appimage-ail-scrub :shebang "#!/usr/bin/env bash"
set -Eeuo pipefail
echo "== AIL scrub (user + system) =="
systemctl --user disable --now appimagelauncherd.service 2>/dev/null || true
systemctl --global disable appimagelauncherd.service 2>/dev/null || true
sudo systemctl --global disable appimagelauncherd.service 2>/dev/null || true
rm -f ~/.config/systemd/user/appimagelauncherd.service 2>/dev/null || true
sudo rm -f /etc/systemd/user/appimagelauncherd.service /usr/lib/systemd/user/appimagelauncherd.service 2>/dev/null || true
sudo rm -f /etc/systemd/user/default.target.wants/appimagelauncherd.service /usr/lib/systemd/user/default.target.wants/appimagelauncherd.service 2>/dev/null || true

# MIME + desktop traces

sed -i '/application/x-appimage/d' ~/.config/mimeapps.list 2>/dev/null || true
sed -i '/application/x-appimage/d' ~/.local/share/applications/mimeapps.list 2>/dev/null || true
sudo update-desktop-database /usr/share/applications 2>/dev/null || true
sudo update-mime-database /usr/share/mime 2>/dev/null || true

# Package repo crumbs (leave .deb cache as-is)

sudo rm -f /etc/apt/sources.list.d/appimagelauncher-team-*.list /etc/apt/trusted.gpg.d/appimagelauncher-team-*.gpg* 2>/dev/null || true
systemctl --user daemon-reload || true
systemctl --user daemon-reexec || true
echo "== done =="
#+END_SRC

** Set up =appimaged= as our integrator (user service)
- Picks the newest =~/Applications/appimaged-*-x86_64.AppImage= and installs a stable wrapper at =~/.local/bin/appimaged=
- Creates/refreshes the user service

#+BEGIN_SRC bash :tangle all/.local/bin/appimage-integrator-setup :shebang "#!/usr/bin/env bash"
set -Eeuo pipefail
APPS_DIR="${APPS_DIR:-$HOME/Applications}"
BIN="$HOME/.local/bin/appimaged"

cand="$(ls -t "$APPS_DIR"/appimaged-*-x86_64.AppImage 2>/dev/null | head -n1 || true)"
if [[ -z "$cand" ]]; then
echo "!! No appimaged-*-x86_64.AppImage in $APPS_DIR"; exit 1
fi
install -Dm755 "$cand" "$BIN"

mkdir -p ~/.config/systemd/user
cat >~/.config/systemd/user/appimaged.service <<'EOF'
[Unit]
Description=appimaged (AppImage integration daemon)
After=graphical-session.target

[Service]
ExecStart=%h/.local/bin/appimaged -v -q
Restart=on-failure
RestartSec=2
Environment=PATH=%h/.local/bin:/usr/local/bin:/usr/bin

[Install]
WantedBy=default.target
EOF

systemctl --user daemon-reload
systemctl --user enable --now appimaged.service
sleep 1
systemctl --user status appimaged --no-pager || true
#+END_SRC

** Health check: only one integrator and it’s ours
#+BEGIN_SRC bash :tangle all/.local/bin/appimage-health :shebang "#!/usr/bin/env bash"
set -Eeuo pipefail
echo "== Integrator processes =="
pgrep -af appimaged || echo "(none)"
pgrep -af appimagelauncher || echo "(no AIL)"
echo "== appimaged status =="
systemctl --user status appimaged --no-pager || true
echo "== recent logs =="
journalctl --user -u appimaged -n 50 --no-pager || true
#+END_SRC

* Bulk update of all AppImages (self-update first, remove old)

- Uses =~/Applications/appimageupdatetool-x86_64.AppImage=
- Skips itself (& AppImageUpdate) since =--self-update= handles them
- **Never** aborts on failures; logs and continues

#+BEGIN_SRC bash :tangle all/.local/bin/appimage-update-all :shebang "#!/usr/bin/env bash"
set -Eeuo pipefail

APPS_DIR="${APPS_DIR:-$HOME/Applications}"
LOG="${LOG:-$HOME/appimage-update.log}"
TOOL="$APPS_DIR/appimageupdatetool-x86_64.AppImage"
SELF_UPDATE="${SELF_UPDATE:-1}"

ts() { date +"%Y-%m-%d %H:%M:%S"; }

echo "== appimage-update-all @ $(ts) ==" | tee -a "$LOG"
echo "APPS_DIR=$APPS_DIR" | tee -a "$LOG"
echo "TOOL=$TOOL" | tee -a "$LOG"

if [[ "$SELF_UPDATE" = "1" && -x "$TOOL" ]]; then
  echo "-- self-updating appimageupdatetool..." | tee -a "$LOG"
  if "$TOOL" --self-update >>"$LOG" 2>&1; then
    echo "ok: self-update" | tee -a "$LOG"
  else
    echo "warn: self-update failed (continuing)" | tee -a "$LOG"
  fi
fi

shopt -s nullglob
{
  for path in "$APPS_DIR"/*.AppImage; do
    base="$(basename -- "$path")"
    case "$base" in
      appimageupdatetool-*.AppImage|AppImageUpdate-*.AppImage)
        echo "skip: $base" | tee -a "$LOG"; continue ;;
    esac

    echo "==> $base" | tee -a "$LOG"

    if [[ ! -x "$TOOL" ]]; then
      echo "fail: no appimageupdatetool at $TOOL" | tee -a "$LOG"
      continue
    fi

    set +e
    "$TOOL" -r "$path" >>"$LOG" 2>&1
    rc=$?
    set -e

    if [[ $rc -eq 0 ]]; then
      echo "ok: $base" | tee -a "$LOG"
    else
      echo "fail: $base (exit $rc). continuing." | tee -a "$LOG"
    fi
  done
} 2>>"$LOG"
shopt -u nullglob

# Refresh the appimaged wrapper (idempotent)
if command -v systemctl >/dev/null 2>&1; then
  if systemctl --user is-enabled --quiet appimaged.service 2>/dev/null; then
    ln -sf "$APPS_DIR"/appimaged-*-x86_64.AppImage "$HOME/.local/bin/appimaged"
    chmod +x "$HOME/.local/bin/appimaged"
    echo "-- appimaged wrapper already up to date" | tee -a "$LOG"
  fi
fi

# Make sure everything we touch is executable
chmod -f +x "$APPS_DIR"/*.AppImage 2>/dev/null || true
chmod -f +x "$HOME/.local/share/applications/"*.desktop 2>/dev/null || true

# Scrub broken .desktop entries (integrated)
APPS="$APPS_DIR" ~/.local/bin/appimage-scrub-desktops

echo "== done @ $(ts) ==" | tee -a "$LOG"
#+END_SRC

* Scrub broken .desktop entries and refresh caches
Targets the exact failure you showed (“Exec program … not been found on the PATH”), and also:

- trashes entries whose =Exec= is an absolute path that no longer exists
- trashes entries whose =Exec= binary name isn’t on PATH
- uses =gio trash= if available, otherwise =rm -f=
- refreshes desktop caches at the end

#+BEGIN_SRC bash :tangle all/.local/bin/appimage-scrub-desktops :shebang "#!/usr/bin/env bash"
set -Eeuo pipefail

APPS="${APPS:-$HOME/Applications}"
DESK_DIR="$HOME/.local/share/applications"

echo "== scrubbing $DESK_DIR/*.desktop =="

# fix perms proactively
chmod -f +x "$APPS"/*.AppImage 2>/dev/null || true
chmod -f +x "$DESK_DIR"/*.desktop 2>/dev/null || true

# Trash entries whose Exec= points to a non-existent absolute path
shopt -s nullglob
for f in "$DESK_DIR"/*.desktop; do
  exec_line="$(awk -F= '/^Exec=/{print $2; exit}' "$f")"
  if [[ -n "$exec_line" && "$exec_line" == /* ]]; then
    exe="${exec_line%% *}"
    if [[ ! -e "$exe" ]]; then
      echo "trash: $f  [missing absolute Exec: $exe]"
      gio trash "$f" || rm -f -- "$f"
    fi
  fi
done
shopt -u nullglob

update-desktop-database "$DESK_DIR" >/dev/null 2>&1 || true
update-mime-database "$HOME/.local/share/mime" >/dev/null 2>&1 || true
echo "== done =="
#+END_SRC

** Inventory tool
Reads overrides from the tangled TSV.
#+BEGIN_SRC bash :tangle all/.local/bin/appimage-inventory :shebang "#!/usr/bin/env bash"
#!/usr/bin/env bash
set -Eeuo pipefail
APPS_DIR="${APPS_DIR:-$HOME/Applications}"
INV_DIR="${INV_DIR:-$HOME/.dotfiles/all/.appimage/inventory}"
TOOL="$APPS_DIR/appimageupdatetool-x86_64.AppImage"

mkdir -p "$INV_DIR"

all_tsv="$INV_DIR/all.tsv"
sup_tsv="$INV_DIR/supports.tsv"
man_tsv="$INV_DIR/manual.tsv"
dead_tsv="$INV_DIR/dead.tsv"
dead_over="$INV_DIR/dead-overrides.tsv"

printf "FILE\tNAME\tHAS_UPDATE_INFO\tUPDATE_KIND\tNOTE\n" >"$all_tsv"

# Optional strict mode: require -j to succeed (0/1) to keep in "supports".
STRICT="${STRICT:-1}"
# If set to 1, treat GitHub 403 rate-limit as temporarily OK (keeps in supports)
RELAX_ON_403="${RELAX_ON_403:-0}"

# Run a command quietly and return only its exit code (no ABRT spew).
quiet_rc() {
  # Use a subshell with set +e so nonzero/signal exits don't bubble,
  # and redirect both streams away.
  ( set +e; "$@"; exit $? ) >/dev/null 2>&1
  echo $?
}

shopt -s nullglob
for f in "$APPS_DIR"/*.AppImage; do
  base="$(basename -- "$f")"; name="${base%.AppImage}"
  has="no"; kind=""; note=""

  if [[ -x "$TOOL" ]]; then
    # Describe; treat output as data even if rc != 0
    desc_out="$("$TOOL" -d "$f" 2>&1 || true)"

    if grep -q '^[[:space:]]*Update information type:' <<<"$desc_out"; then
      has="yes"
      kind="$(sed -n 's/^[[:space:]]*Update information type:[[:space:]]*//p' <<<"$desc_out" | head -n1)"

      if [[ "$STRICT" = "1" ]]; then
        # Try up to 3 times with small backoff to avoid GitHub 403s
        tries=0
        chk_rc=255
        j_out=""
        while (( tries < 3 )); do
          set +e
          j_out="$("$TOOL" -j "$f" 2>&1)"
          chk_rc=$?
          set -e
          if [[ $chk_rc -eq 0 || $chk_rc -eq 1 ]]; then
            break
          fi
          # If rate-limited, brief backoff
          if grep -q 'HTTP status 403' <<<"$j_out"; then
            sleep 2
          else
            # non-403 failure; no point retrying
            break
          fi
          ((tries++))
        done

        if [[ $chk_rc -eq 0 || $chk_rc -eq 1 ]]; then
          note="ok"
        else
          if grep -q 'HTTP status 403' <<<"$j_out"; then
            note="github-403"
            if [[ "${RELAX_ON_403:-0}" = "1" ]]; then
              :  # keep in supports
            else
              has="no"   # demote to manual under strict policy
            fi
          elif grep -qi 'None of the artifacts matched the pattern' <<<"$j_out"; then
            note="invalid-pattern"; has="no"
          else
            note="broken-update-info-$chk_rc"; has="no"
          fi
        fi
      else
        note="ok"
      fi
    else
      if   grep -qi 'could not find update information' <<<"$desc_out"; then
        note="no-update-info"
      elif grep -qi 'None of the artifacts matched the pattern' <<<"$desc_out"; then
        note="invalid-pattern"
      else
        note="tool-error"
      fi
    fi
  else
    note="no-tool"
  fi

  printf "%s\t%s\t%s\t%s\t%s\n" "$base" "$name" "$has" "$kind" "$note" >>"$all_tsv"
done
shopt -u nullglob

# Build a filtered view of all.tsv that excludes dead overrides
filtered_all="$(mktemp)"
if [[ -f "$dead_over" ]]; then
  awk -F'\t' '
    NR==FNR {
      # read overrides; skip comments/blanks
      if ($0 !~ /^[[:space:]]*#/ && $0 !~ /^[[:space:]]*$/) dead[$0]=1
      next
    }
    FNR==1 { print; next }              # header
    !($1 in dead) { print }             # keep rows not in dead
  ' "$dead_over" "$all_tsv" > "$filtered_all"
else
  cp "$all_tsv" "$filtered_all"
fi

{ head -n1 "$filtered_all"; awk -F'\t' 'NR>1 && $3=="yes"' "$filtered_all"; } >"$sup_tsv"
{ head -n1 "$filtered_all"; awk -F'\t' 'NR>1 && $3=="no"'  "$filtered_all"; } >"$man_tsv"

# dead.tsv = explicit human call via overrides
: >"$dead_tsv"
if [[ -f "$dead_over" ]]; then
  while IFS= read -r line; do
    [[ -z "$line" || "$line" =~ ^# ]] && continue
    # Allow entries with spaces WITHOUT quoting in the TSV (no quotes needed)
    if awk -F'\t' -v w="$line" 'NR>1 && $1==w' "$all_tsv" >/dev/null; then
      printf "%s\n" "$line" >>"$dead_tsv"
    fi
  done <"$dead_over"
fi

ORG_FILE="${ORG_FILE:-$HOME/.dotfiles/appimage.org}"

if [[ -f "$ORG_FILE" ]]; then
  # inject into named blocks (only ones that exist will change)
  appimage-org-inject "$ORG_FILE" appimage-inventory-all      "$all_tsv" || true
  appimage-org-inject "$ORG_FILE" appimage-inventory-supports "$sup_tsv" || true
  appimage-org-inject "$ORG_FILE" appimage-inventory-manual   "$man_tsv" || true
  # If you later add the dead block back, this line will start updating it automatically:
  appimage-org-inject "$ORG_FILE" appimage-inventory-dead     "$dead_tsv" || true

  echo "updated blocks in $ORG_FILE:"
  echo "  - appimage-inventory-all"
  echo "  - appimage-inventory-supports"
  echo "  - appimage-inventory-manual"
  # echo "  - appimage-inventory-dead"    # uncomment if you re-add that block
else
  echo "note: $ORG_FILE not found; skipped org injection."
fi

sup_n=$(($(wc -l <"$sup_tsv")-1))
man_n=$(($(wc -l <"$man_tsv")-1))
dead_n=$(wc -l <"$dead_tsv" | awk '{print $1}')
echo "== inventory =="
echo "supports: $sup_n"
echo "manual:   $man_n"
echo "dead:     $dead_n"
echo "wrote:"
echo "  $all_tsv"
echo "  $sup_tsv"
echo "  $man_tsv"
echo "  $dead_tsv (from $dead_over)"
#+END_SRC

** AppImage Org-Mode Injector
Replace the contents of a named org src block.
#+BEGIN_SRC bash :tangle all/.local/bin/appimage-org-inject :shebang "#!/usr/bin/env bash"
set -Eeuo pipefail
# Usage: appimage-org-inject <org-file> <block-name> <payload-file>
org="${1:?org file}"; name="${2:?block name}"; payload="${3:?payload file}"
tmp="$(mktemp)"

awk -v name="$name" -v payload="$payload" '
  BEGIN { in_target=0; in_body=0 }
  {
    if (!in_target) {
      if ($0 ~ "^#\\+name:[[:space:]]*" name "[[:space:]]*$") {
        print; in_target=1; next
      } else {
        print; next
      }
    } else if (in_target && !in_body) {
      # Expect the BEGIN_SRC line right after the named block
      if ($0 ~ "^#\\+BEGIN_SRC[[:space:]]") {
        print; in_body=1; next
      } else {
        # If someone inserted comments between name and block, still pass through
        print; next
      }
    } else if (in_target && in_body) {
      # We are inside the block body. Replace until END_SRC.
      if ($0 ~ "^#\\+END_SRC[[:space:]]*$") {
        # inject payload BEFORE END_SRC, then print END_SRC and reset flags
        while ((getline line < payload) > 0) print line
        close(payload)
        print
        in_target=0; in_body=0
        next
      } else {
        # skip existing block content
        next
      }
    }
  }
  END {
    if (in_target || in_body) {
      # Block never closed; be conservative and just append payload then END_SRC
      while ((getline line < payload) > 0) print line
      close(payload)
      print "#+END_SRC"
    }
  }
' "$org" > "$tmp"

mv "$tmp" "$org"
echo "Injected into $org :: $name"
#+END_SRC

* Makefile glue (appimage.mk)
#+BEGIN_SRC makefile :tangle all/.mk/appimage.mk
# ~/.dotfiles/all/.mk/appimage.mk
.RECIPEPREFIX := |
SHELL := /bin/bash

APPS_DIR   := $(HOME)/Applications
BIN_DIR    := $(HOME)/.local/bin

INTEGRATE  := $(BIN_DIR)/appimage-integrator-setup
AIL_SCRUB  := $(BIN_DIR)/appimage-ail-scrub
HEALTH     := $(BIN_DIR)/appimage-health
UPDATE_ALL := $(BIN_DIR)/appimage-update-all
SCRUB_DESK := $(BIN_DIR)/appimage-scrub-desktops

.PHONY: appimage-integrate appimage-ail-scrub appimage-health \
        appimage-update appimage-update-all appimage-scrub-desktops

appimage-integrate: $(INTEGRATE)
| $(INTEGRATE)

appimage-ail-scrub: $(AIL_SCRUB)
| $(AIL_SCRUB)

appimage-health: $(HEALTH)
| $(HEALTH)

# New short verb
appimage-update: $(UPDATE_ALL)
| env SELF_UPDATE=1 $(UPDATE_ALL)

# Back-compat alias
appimage-update-all: appimage-update

# (kept for reference; no longer needed separately)
appimage-scrub-desktops: $(SCRUB_DESK)
| $(SCRUB_DESK)
#+END_SRC

* Include in your root Makefile (idempotent)
Add this include to your main =Makefile= (your file already includes others).

#+BEGIN_SRC makefile :tangle Makefile.d/appimage.include.mk :padline no :comments none
include $(HOME)/.dotfiles/all/.mk/appimage.mk
#+END_SRC

* Notes: manual override of update info (future work)
=appimageupdatetool= supports injecting update info for non-compliant AppImages:

#+BEGIN_SRC text :tangle no
appimageupdatetool-x86_64.AppImage 
-u 'gh-releases-zsync|ORG|REPO|TAG|pattern-*-x86_64.AppImage.zsync' 
-r /path/to/Your.AppImage

# pattern must match the upstream artifact names; we can maintain a per-file overrides map later.

#+END_SRC
