all/.local/bin/appimage-org-inject
#!/usr/bin/env bash
# AppImage Org-Mode Injector
# Replace the contents of a named org src block.

# [[file:../../../appimage.org::*AppImage Org-Mode Injector][AppImage Org-Mode Injector:1]]
set -Eeuo pipefail
# Usage: appimage-org-inject <org-file> <block-name> <payload-file>
org="${1:?org file}"; name="${2:?block name}"; payload="${3:?payload file}"
tmp="$(mktemp)"

awk -v name="$name" -v payload="$payload" '
  BEGIN { in_target=0; in_body=0 }
  {
    if (!in_target) {
      if ($0 ~ "^#\\+name:[[:space:]]*" name "[[:space:]]*$") {
        print; in_target=1; next
      } else {
        print; next
      }
    } else if (in_target && !in_body) {
      # Expect the BEGIN_SRC line right after the named block
      if ($0 ~ "^#\\+BEGIN_SRC[[:space:]]") {
        print; in_body=1; next
      } else {
        # If someone inserted comments between name and block, still pass through
        print; next
      }
    } else if (in_target && in_body) {
      # We are inside the block body. Replace until END_SRC.
      if ($0 ~ "^#\\+END_SRC[[:space:]]*$") {
        # inject payload BEFORE END_SRC, then print END_SRC and reset flags
        while ((getline line < payload) > 0) print line
        close(payload)
        print
        in_target=0; in_body=0
        next
      } else {
        # skip existing block content
        next
      }
    }
  }
  END {
    if (in_target || in_body) {
      # Block never closed; be conservative and just append payload then END_SRC
      while ((getline line < payload) > 0) print line
      close(payload)
      print "#+END_SRC"
    }
  }
' "$org" > "$tmp"

mv "$tmp" "$org"
echo "Injected into $org :: $name"
# AppImage Org-Mode Injector:1 ends here
