all/.local/bin/appimage-scrub-desktops
#!/usr/bin/env bash
# Scrub broken .desktop entries and refresh caches
# Targets the exact failure you showed (“Exec program … not been found on the PATH”), and also:

# - trashes entries whose =Exec= is an absolute path that no longer exists
# - trashes entries whose =Exec= binary name isn’t on PATH
# - uses =gio trash= if available, otherwise =rm -f=
# - refreshes desktop caches at the end


# [[file:../../../appimage.org::*Scrub broken .desktop entries and refresh caches][Scrub broken .desktop entries and refresh caches:1]]
set -Eeuo pipefail

APPS="${APPS:-$HOME/Applications}"
DESK_DIR="$HOME/.local/share/applications"

echo "== scrubbing $DESK_DIR/*.desktop =="

# fix perms proactively
chmod -f +x "$APPS"/*.AppImage 2>/dev/null || true
chmod -f +x "$DESK_DIR"/*.desktop 2>/dev/null || true

# Trash entries whose Exec= points to a non-existent absolute path
shopt -s nullglob
for f in "$DESK_DIR"/*.desktop; do
  exec_line="$(awk -F= '/^Exec=/{print $2; exit}' "$f")"
  if [[ -n "$exec_line" && "$exec_line" == /* ]]; then
    exe="${exec_line%% *}"
    if [[ ! -e "$exe" ]]; then
      echo "trash: $f  [missing absolute Exec: $exe]"
      gio trash "$f" || rm -f -- "$f"
    fi
  fi
done
shopt -u nullglob

update-desktop-database "$DESK_DIR" >/dev/null 2>&1 || true
update-mime-database "$HOME/.local/share/mime" >/dev/null 2>&1 || true
echo "== done =="
# Scrub broken .desktop entries and refresh caches:1 ends here
