all/.local/bin/appimage-update-all
#!/usr/bin/env bash
# Bulk update of all AppImages (self-update first, remove old)

# - Uses =~/Applications/appimageupdatetool-x86_64.AppImage=
# - Skips itself (& AppImageUpdate) since =--self-update= handles them
# - **Never** aborts on failures; logs and continues


# [[file:../../../appimage.org::*Bulk update of all AppImages (self-update first, remove old)][Bulk update of all AppImages (self-update first, remove old):1]]
set -Eeuo pipefail

APPS_DIR="${APPS_DIR:-$HOME/Applications}"
LOG="${LOG:-$HOME/appimage-update.log}"
TOOL="$APPS_DIR/appimageupdatetool-x86_64.AppImage"
SELF_UPDATE="${SELF_UPDATE:-1}"

ts() { date +"%Y-%m-%d %H:%M:%S"; }

echo "== appimage-update-all @ $(ts) ==" | tee -a "$LOG"
echo "APPS_DIR=$APPS_DIR" | tee -a "$LOG"
echo "TOOL=$TOOL" | tee -a "$LOG"

if [[ "$SELF_UPDATE" = "1" && -x "$TOOL" ]]; then
  echo "-- self-updating appimageupdatetool..." | tee -a "$LOG"
  if "$TOOL" --self-update >>"$LOG" 2>&1; then
    echo "ok: self-update" | tee -a "$LOG"
  else
    echo "warn: self-update failed (continuing)" | tee -a "$LOG"
  fi
fi

shopt -s nullglob
{
  for path in "$APPS_DIR"/*.AppImage; do
    base="$(basename -- "$path")"
    case "$base" in
      appimageupdatetool-*.AppImage|AppImageUpdate-*.AppImage)
        echo "skip: $base" | tee -a "$LOG"; continue ;;
    esac

    echo "==> $base" | tee -a "$LOG"

    if [[ ! -x "$TOOL" ]]; then
      echo "fail: no appimageupdatetool at $TOOL" | tee -a "$LOG"
      continue
    fi

    set +e
    "$TOOL" -r "$path" >>"$LOG" 2>&1
    rc=$?
    set -e

    if [[ $rc -eq 0 ]]; then
      echo "ok: $base" | tee -a "$LOG"
    else
      echo "fail: $base (exit $rc). continuing." | tee -a "$LOG"
    fi
  done
} 2>>"$LOG"
shopt -u nullglob

# Refresh the appimaged wrapper (idempotent)
if command -v systemctl >/dev/null 2>&1; then
  if systemctl --user is-enabled --quiet appimaged.service 2>/dev/null; then
    ln -sf "$APPS_DIR"/appimaged-*-x86_64.AppImage "$HOME/.local/bin/appimaged"
    chmod +x "$HOME/.local/bin/appimaged"
    echo "-- appimaged wrapper already up to date" | tee -a "$LOG"
  fi
fi

# Make sure everything we touch is executable
chmod -f +x "$APPS_DIR"/*.AppImage 2>/dev/null || true
chmod -f +x "$HOME/.local/share/applications/"*.desktop 2>/dev/null || true

# Scrub broken .desktop entries (integrated)
APPS="$APPS_DIR" ~/.local/bin/appimage-scrub-desktops

echo "== done @ $(ts) ==" | tee -a "$LOG"
# Bulk update of all AppImages (self-update first, remove old):1 ends here
